// 文件名称: font_color.js
//
// 创 建 人: chenshy
// 创建日期: 2014/09/02
// 描    述: 字体颜色值定义，需要加颜色改此文件
// 该文件对应文字颜色修改
define(function(){
    /**
     * 颜色值数组
     * 数组里只有一个颜色值表示单色，
     * 多个颜色值表渐变
     * @type {*[]}
     */
    var colors = [
        {colors:["#FFFFFF"]},
        {colors:["#F3D5EF"]},
        {colors:["#C9D8FF"]},
        {colors:["#B8FEFE"]},
        {colors:["#D2FEA5"]},
        {colors:["#FEF5CA"]},
        {colors:["#FDDBAD"]},
        {colors:["#FEF5CA"]},
        {colors:["#FDDBAD"]},
        {colors:["#FFC4C4"]},
        {colors:["#CECECE"]},
        {colors:["#E8A0E2"]},
        {colors:["#7D9EFD"]},
        {colors:["#7BF5FF"]},
        {colors:["#B2FF65"]},
        {colors:["#FFF681"]},
        {colors:["#FF0101"]},
        {colors:["#FFC073"]},
        {colors:["#FF8A8A"]},
        {colors:["#A0A0A0"]},
        {colors:["#EE72E2"]},
        {colors:["#3567FC"]},
        {colors:["#00FCFF"]},
        {colors:["#97EE23"]},
        {colors:["#FDD93A"]},
        {colors:["#FEA841"]},
        {colors:["#FF3F3E"]},
        {colors:["#717171"]},
        {colors:["#003CFF"]},
        {colors:["#00CDFF"]},
        {colors:["#32C715"]},
        {colors:["#FECE00"]},
        {colors:["#FF8B00"]},
        {colors:["#FF0101"]},
        {colors:["#3F3F3F"]},
        {colors:["#911091"]},
        {colors:["#0A2C90"]},
        {colors:["#01829F"]},
        {colors:["#016E01"]},
        {colors:["#D09D03"]},
        {colors:["#D25D00"]},
        {colors:["#B40000"]},
        {colors:["#000000"]},
        {colors:["#66025C"]},
        {colors:["#041A56"]},
        {colors:["#00576B"]},
        {colors:["#004900"]},
        {colors:["#A57600"]},
        {colors:["#762C00"]},
        {colors:["#820000"]},

        //渐变
        // {colors:["rgba(21,41,77,1)","rgba(21,101,137,1)","rgba(33,169,201,1)","rgba(83,195,209,1)","rgba(170,195,185,1)"]},
        // {colors:["rgba(17,30,83,1)","rgba(49,59,132,1)","rgba(92,94,184,1)","rgba(166,137,212,1)","rgba(240,189,216,1)"]},
        // {colors:["rgba(20,32,81,1)","rgba(44,57,122,1)","rgba(90,97,174,1)","rgba(142,131,201,1)","rgba(196,161,211,1)"]},
        // {colors:["rgba(0,8,44,1)","rgba(1,36,87,1)","rgba(1,69,131,1)","rgba(0,130,183,1)","rgba(0,180,200,1)"]},
        // {colors:["rgba(197,3,2,1)","rgba(253,19,11,1)","rgba(253,63,47,1)","rgba(253,113,88,1)","rgba(250,154,121,1)"]},
        // {colors:["rgba(115,191,208,1)","rgba(158,206,219,1)","rgba(197,219,222,1)","rgba(224,227,218,1)","rgba(248,231,208,1)"]},
        // {colors:["rgba(76,57,183,1)","rgba(112,99,178,1)","rgba(129,132,167,1)","rgba(127,142,154,1)","rgba(87,135,133,1)"]},
        // {colors:["rgba(193,46,172,1)","rgba(201,79,180,1)","rgba(202,115,182,1)","rgba(201,146,181,1)","rgba(210,159,170,1)"]},
        // {colors:["rgba(14,48,55,1)","rgba(31,78,78,1)","rgba(62,120,107,1)","rgba(130,170,126,1)","rgba(204,214,137,1)"]},
        // {colors:["rgba(210,79,134,1)","rgba(210,79,134,1)","rgba(239,111,135,1)","rgba(251,131,121,1)","rgba(251,131,121,1)"]},
        // {colors:["rgba(1,95,139,1)","rgba(0,120,179,1)","rgba(38,156,210,1)","rgba(115,190,226,1)","rgba(158,190,221,1)"]},
        // {colors:["rgba(65,37,95,1)","rgba(116,73,119,1)","rgba(179,107,115,1)","rgba(208,126,111,1)","rgba(221,102,72,1)"]},
        // {colors:["rgba(33,195,189,1)","rgba(70,222,215,1)","rgba(121,248,243,1)","rgba(224,251,252,1)","rgba(248,246,239,1)"]},
        // {colors:["rgba(50,118,178,1)","rgba(94,162,201,1)","rgba(160,203,215,1)","rgba(227,229,210,1)","rgba(232,189,139,1)"]},
        // {colors:["rgba(107,40,186,1)","rgba(91,127,207,1)","rgba(123,206,211,1)","rgba(123,206,211,1)","rgba(244,206,104,1)"]},
        // {colors:["rgba(39,13,110,1)","rgba(84,62,191,1)","rgba(84,62,191,1)","rgba(214,175,255,1)","rgba(241,220,255,1)"]},
        // {colors:["rgba(0,30,68,1)","rgba(0,65,127,1)","rgba(0,65,127,1)","rgba(99,206,230,1)","rgba(196,234,239,1)"]},
        // {colors:["rgba(19,72,85,1)","rgba(56,104,111,1)","rgba(110,141,140,1)","rgba(186,179,160,1)","rgba(242,193,138,1)"]},
        // {colors:["rgba(242,193,138,1)","rgba(66,81,156,1)","rgba(75,88,162,1)","rgba(110,112,174,1)","rgba(137,110,147,1)"]},
        // {colors:["rgba(45,52,81,1)","rgba(67,67,99,1)","rgba(80,78,109,1)","rgba(118,102,124,1)","rgba(178,139,140,1)"]},
        // {colors:["rgba(15,27,75,1)","rgba(66,77,162,1)","rgba(122,117,206,1)","rgba(122,117,206,1)","rgba(247,191,215,1)"]}
    ];

    return colors;
});
//
//if ( typeof define === "function" && define.amd) {
//    define(function () { return jQuery; } );
//}